# Pivot Tables with Pandas - Lab

## Introduction

In this lab, we'll learn how to make use of our newfound knowledge of pivot tables to work with real-world data.  We'll start by exploring 

## Objectives

You will be able to:

* Understand and explain what a multi-level hierarchical index is
* Understand, explain the difference and use df.pivot and pd.pivot_table
* Switch between “long” and “wide” in a DataFrame using stack() and unstack()
* Transform “wide” to “long” DataFrames using `melt`

## Getting Started

### Import Pandas and Matplotlib.pyplot Using Standard Aliases

In the cell below:

* Import `pandas` and set the standard alias
* Import `matplotlib.pyplot` and set the standard alias
* Run the ipython magic command to display matplotlib graphs inline within the notebook

## Load the Data
The data for this activity is stored in a file called `'causes_of_death.tsv'` which is a somewhat morbid dataset from the center for disease control. Note that the file extension .tsv indicates that this data is formatted slightly differently then the standard .csv, the difference being that it has 'tab seperated values' instead of 'comma seperated values'. As such, pass in the optional parameter `delimiter='\t'` into the `pd.read_csv()` method.

In [ ]:
df = None

Now, display the head of the DataFrame to ensure everything loaded correctly.

Our data is currently in **_Wide_** format.  We can tidy this up by converting it to **_Long_** format by using groupby statements to aggregate our data into a much neater, more readable format. 

## Groupby Aggregations

Complete the following groupby statements.

### 1) Groupby State and Gender. Sum the values.

In [ ]:
# Your code here

### 2) Groupby State and Gender and Race. Find the average values.

In [ ]:
# Your code here

### 3) Groupby Gender and Race. Find the minimum values.

In [ ]:
# Your code here

### 4) Create a bar chart of the total number of deaths by state.
* Sort your columns in order (ascending or descending are both acceptable).  
* Also make sure to include a title, axes labels and have your graph be an appropriate size.

**_NOTE:_** In order to do this, slice the `Deaths` column after the `.groupby()` method, but before the `sum()` method.  You can even chain the `.plot()` call on after the `sum()` call and do this all on one line, excluding the labeling of the graph!

In [ ]:
#Your code here

### Inspecting our Data

Let's go one step further and get a print-out of the data type of each column. 

In the cell below, get the `.info()` of our DataFrame, and note the data type that each column is currently stored as.

Let's look at some samples from the Population column to see if the current encoding seems appropriate for the data it contains. 

In the cell below, display the population values for the first 5 rows in the DataFrame.

Just to be extra sure, let's check the value counts to see how many times each unique value shows up in the dataset. We'll only look at the top 5. 

In the cell below, print out the top 5 `value_counts()` of the population column of the DataFrame.

Clearly, this data should be stored as a numeric type, not a categorical type.  
 
### 5 a) Reformat the Population Column as an Integer
As stands, not all values will be able to be reformated as integers. Most of the cells in the the `Population` column contain integer values, but the entire column is currently encoded in string format because some cells contain the string `"Not Applicable"`.

We need to remove these rows before we can cast the Population column to an Integer data type. 

In the cell below:

* Slice the rows of `df` where the Population column is equal to `'Not Applicable'`.
* Use `to_drop.index`  to drop the offending rows from `df`. Be sure to set the `axis=0`, and `inplace=True`
* Cast the Population column to an integer data type using the `.astype()` function, with the single parameter `int64` passed in. 
* Print the Population column's `dtype` attribute to confirm it is now stored in `int64` format. 

**_NOTE:_** `.astype()` returns a copy of the column, so make sure you set the Population column equal to what this method returns--don't just call it!

In [ ]:
#Your code here
to_drop = None

### 5 b) Complete the Bar Chart

Now that we've reformatted our data, let's create a bar chart of the of the Mean Population by State.

In [ ]:
#Your code here

Below we will investigate how we can combine the **pivot** method along with the **groupby** method to combine some cool **stacked bar charts**!

## Using Aggregate Functions

In the cell below:

* Group `df` by `'State'` and  `'Gender'`, and then slice both `'Deaths'` and `'Population'` from it. Chain the `.agg()` method to return the mean, min, max, and standard deviation these sliced columns. 

**_NOTE:_** This only requires one line of code.  

By now, you've probably caught on that the code required to do this follows this pattern:    `([things to group by])[columns to slice].agg([aggregates to return])`

Then, display the head of this of this new DataFrame.

In [ ]:
# A sample groupby similar to above. 
grouped = None

Note how Pandas denotes a multi-hierarchical index in the DataFrame above.  

Let's inspect how a multi-hierarchical index is actually stored.  

In the cell below, display the `index` attribute of this DataFrame.

A two-dimensional array denotes the multiple levels, with each possible combination being a row in our `grouped` DataFrame.  

Let's reset the index, and then see how it changes. 

In the cell below, call the DataFrame's `reset_index()` function.  Then, display the head of the DataFrame.

In [ ]:
# First, reset the index. Notice the subtle difference; State and Gender are now columns rather then the index.
grouped = None

Note how the way the index is displayed has changed.  The index columns that made up the multi-hierarchical index before are now stored as columns of data, with each row given a more traditional numerical index. 

Let's confirm this by reexamining the `index` attribute of `grouped` in the cell below.

However, look again at the displayed DataFrame--specifically, the columns.  Resetting the index has caused the DataFrame to use a mutlti-indexed structure for the columns. 

In the cell below, examine the `columns` attribute of `grouped` to confirm this.

In [ ]:
#Notice that this causes columns to be MultiIndexed!

### Column Levels

Since we're working with miulti-hierarchical indices, we can examine the indices available at each level.

In the cell below, use the `get_level_values` method contained within the DataFrame's `columns` object to get the values for the outermost layer of the index.

In [37]:
import pandas as pd
df = pd.read_csv('causes_of_death.tsv', header =[1,2,3], delimiter='\t')

In [38]:
df['new'] = 1

In [39]:
df.head()

,Unnamed: 0_level_0,Alabama,01,< 1 year,1,Female,F,American Indian or Alaska Native,1002-5,14,3579,Unreliable,new
,Unnamed: 0_level_1,Alabama,01,< 1 year,1,Female,F,Asian or Pacific Islander,A-PI,24,7443,322.5,
,Unnamed: 0_level_2,Alabama,01,< 1 year,1,Female,F,Black or African American,2054-5,2093,169339,1236.0,
0,NaN,Alabama,1,< 1 year,1,Female,F,White,2106-3,2144,347921,616.2,1
1,NaN,Alabama,1,< 1 year,1,Male,M,Asian or Pacific Islander,A-PI,33,7366,448.0,1
2,NaN,Alabama,1,< 1 year,1,Male,M,Black or African American,2054-5,2732,173241,1577.0,1
3,NaN,Alabama,1,< 1 year,1,Male,M,White,2106-3,2788,364029,765.9,1
4,NaN,Alabama,1,1-4 years,1-4,Female,F,Asian or Pacific Islander,A-PI,10,30421,Unreliable,1

In [18]:
df.Gender = [1] * len(df.Gender)

In [28]:
df.columns

Index(['Notes', 'State', 'State Code', 'Ten-Year Age Groups',
       'Ten-Year Age Groups Code', 'Gender', 'Gender Code', 'Race',
       'Race Code', 'Deaths', 'Population', 'Crude Rate', 'new'],
      dtype='object')

In [20]:
df['Gender']

0       1
1       1
2       1
3       1
4       1
5       1
6       1
7       1
8       1
9       1
10      1
11      1
12      1
13      1
14      1
15      1
16      1
17      1
18      1
19      1
20      1
21      1
22      1
23      1
24      1
25      1
26      1
27      1
28      1
29      1
       ..
4085    1
4086    1
4087    1
4088    1
4089    1
4090    1
4091    1
4092    1
4093    1
4094    1
4095    1
4096    1
4097    1
4098    1
4099    1
4100    1
4101    1
4102    1
4103    1
4104    1
4105    1
4106    1
4107    1
4108    1
4109    1
4110    1
4111    1
4112    1
4113    1
4114    1
Name: Gender, Length: 4115, dtype: int64

Now, get the level values for the inner layer of the index.

In [3]:
grouped = df.groupby(['State', 'Gender'])['Deaths', 
                                          'Population'].agg(['mean', 
                                                             'min', 'max', 'std'])
grouped.head()

                      Deaths
                        mean min     max           std
State   Gender
Alabama Female  10753.325000  10  116297  24612.250487
        Male    10503.585366  10   88930  20620.218089
Alaska  Female    679.975000  13    4727   1154.870455
        Male      860.357143  12    5185   1411.777392
Arizona Female   8800.622222  21  133923  25979.871632

## Flattening the DataFrame

We can also **_flatten_** the DataFrame from a multi-hierarchical index to more traditional one-dimensional index.  We do this by creating each unique combination possible of every level of the multi-hierarchical index.  Since this is a complex task, you do not need to write it--but take some time to examine the code in the cell below and see if you can understand how it works!

In [6]:
#We could also flatten these:
cols0 = grouped.columns.get_level_values(0)
cols1 = grouped.columns.get_level_values(1)
grouped.columns = [col0 + '_' + col1 if col1 != '' else col0 for col0, col1 in list(zip(cols0, cols1))]
#The list comprehension above is more complicated then what we need but creates a nicer formatting and
#demonstrates using a conditional within a list comprehension.
#This simpler version works but has some tail underscores where col1 is blank:
#grouped.columns = [col0 + '_' + col1 for col0, col1 in list(zip(cols0, cols1))]
grouped.columns

Index(['Deaths_mean', 'Deaths_min', 'Deaths_max', 'Deaths_std'], dtype='object')

In [8]:
cols0

Index(['Deaths', 'Deaths', 'Deaths', 'Deaths'], dtype='object')

In [9]:
cols1

Index(['mean', 'min', 'max', 'std'], dtype='object')

In [10]:
list(zip(cols0, cols1))

[('Deaths', 'mean'), ('Deaths', 'min'), ('Deaths', 'max'), ('Deaths', 'std')]

In [7]:
grouped

                              Deaths_mean  Deaths_min  Deaths_max  \
State                Gender
Alabama              Female  10753.325000          10      116297
                     Male    10503.585366          10       88930
Alaska               Female    679.975000          13        4727
                     Male      860.357143          12        5185
Arizona              Female   8800.622222          21      133923
                     Male     9405.659574          12      110347
Arkansas             Female   6621.615385          11       81126
                     Male     6301.690476          10       61671
California           Female  45233.297872          16      720306
                     Male    46406.297872          29      473226
Colorado             Female   6460.162791          11      102790
                     Male     6299.911111          11       67020
Connecticut          Female   6966.325000          12      123075
                     Male     6161.878049          11       65879
Delaware             Female   2000.029412          11       21627
                     Male     1940.914286          13       15976
District of Columbia Female   1451.125000          11       10428
                     Male     1443.545455          10        7066
Florida              Female  34383.886364          19      550300
                     Male    35178.695652          10      411612
Georgia              Female  15372.317073          20      162447
                     Male    13972.266667          12      116794
Hawaii               Female   2182.944444          10       23476
                     Male     2341.450000          11       18791
Idaho                Female   2874.323529          11       38088
                     Male     2693.421053          15       27053
Illinois             Female  22343.837209          13      348960
                     Male    20713.318182          15      210711
Indiana              Female  13425.717949          11      185795
                     Male    12391.000000          12      126266
...                                   ...         ...         ...
Oklahoma             Female   7451.931818          11      103703
                     Male     7303.333333          14       76790
Oregon               Female   6560.840909          10      115055
                     Male     6528.977273          13       74395
Pennsylvania         Female  28548.047619          10      473687
                     Male    25926.441860          20      297094
Rhode Island         Female   2746.970588          10       42473
                     Male     2180.763158          11       22680
South Carolina       Female   9481.921053          11       93345
                     Male     8657.162791          12       72346
South Dakota         Female   1932.757576          14       28814
                     Male     1800.500000          10       17216
Tennessee            Female  13334.325000          13      161305
                     Male    13008.634146          15      118394
Texas                Female  33128.363636          11      451158
                     Male    32860.130435          11      332525
Utah                 Female   3046.547619          10       47195
                     Male     3011.909091          11       32732
Vermont              Female   2124.695652          10       20967
                     Male     1785.846154          12       12790
Virginia             Female  13232.146341          10      166555
                     Male    12014.659091          17      113238
Washington           Female   9796.863636          33      164439
                     Male     9658.311111          17      106742
West Virginia        Female   6247.225806          15       65256
                     Male     6211.612903          10       51167
Wisconsin            Female   9918.113636          10      189242
                     Male     9573.454545          13      113692
Wyoming              Female   1161.031250          10       13140
                     Male     1149.514286          10       10113

                                Deaths_std
State                Gender
Alabama              Female   24612.250487
                     Male     20620.218089
Alaska               Female    1154.870455
                     Male      1411.777392
Arizona              Female   25979.871632
                     Male     24040.140616
Arkansas             Female   16794.044835
                     Male     14165.374833
California           Female  128295.350557
                     Male    105895.671455
Colorado             Female   19302.972849
                     Male     15620.679010
Connecticut          Female   22224.965241
                     Male     15640.812407
Delaware             Female    4641.612706
                     Male      3808.261525
District of Columbia Female    2649.402766
                     Male      2224.158943
Florida              Female  102083.683121
                     Male     90181.617401
Georgia              Female   33653.636538
                     Male     27107.464138
Hawaii               Female    4781.899001
                     Male      4436.617804
Idaho                Female    7990.822485
                     Male      6665.940386
Illinois             Female   63471.895209
                     Male     47040.841500
Indiana              Female   37468.783350
                     Male     29312.563707
...                                    ...
Oklahoma             Female   20397.710505
                     Male     17036.852025
Oregon               Female   21138.542646
                     Male     17478.932830
Pennsylvania         Female   87939.693608
                     Male     65452.508006
Rhode Island         Female    8334.872239
                     Male      5490.232129
South Carolina       Female   20174.693792
                     Male     16791.712315
South Dakota         Female    5607.382037
                     Male      4260.226617
Tennessee            Female   33524.701804
                     Male     28057.888138
Texas                Female   88400.130788
                     Male     74959.768803
Utah                 Female    9077.541206
                     Male      7526.416912
Vermont              Female    5088.560561
                     Male      3701.620269
Virginia             Female   32699.660272
                     Male     25369.085907
Washington           Female   30095.593305
                     Male     24727.953490
West Virginia        Female   15665.681940
                     Male     13336.347773
Wisconsin            Female   33167.159673
                     Male     25681.359187
Wyoming              Female    2937.935467
                     Male      2569.276968

[102 rows x 4 columns]

In [4]:
grouped.columns.get_level_values(0)

Index(['Deaths', 'Deaths', 'Deaths', 'Deaths'], dtype='object')

In [5]:
grouped.columns

MultiIndex(levels=[['Deaths'], ['mean', 'min', 'max', 'std']],
           labels=[[0, 0, 0, 0], [0, 1, 2, 3]])

Now that we've flattened the DataFrame, let's inspect a couple rows to see what it looks like. 

In the cell below, inspect the head of the `grouped` DataFrame.

## Using Pivots

Now, we'll gain some practice using the DataFrame class's built-in `.pivot()` method.  

In the cell below, call the DataFrame's pivot method with the following parameters:

* index = `'State'`
* columns = `'Gender'`
* values = `'Deaths_mean'`

Then, display the head of our new `pivot` DataFrame to see what it looks like.

In [ ]:
# Now it's time to pivot!
pivot = None

Great! We've just created a pivot table.  

Let's reset the index and see how it changes our pivot table. 

In the cell below, reset the index of the `pivot` object as we did previously.  Then, display the head of the object to see if we can detect any changes.

In [ ]:
# Again, notice the subtle difference of reseting the index:
pivot = None

### Visualizing Data With Pivot Tables

Now, we'll make use of our newly created pivot table to quickly create some visualizations of our data.  

In the cell below, call `pivot.plot()` with the following parameters:

* kind = `'barh'`
* figsize = `(15,8)`

In [ ]:
# Now let's make a sweet bar chart!!

Notice the Y-axis is currently just a list of numbers.  That's because when we reset the index, it defaulted to assigning integers as the index for the DataFrame.  Let's set the index back to `'State'`, and then recreate the visualization. 

In the cell below:

* Use the `pivot` object's `set_index()` method and set the index to `'State'`.  Then, chain this with a `.plot()` call to recreate the visualization using the code we used in the cell above.  

All the code in this cell should be done in a single line.  Just call the methods--do not rebind `pivot` to be equal to this line of code.

In [ ]:
#Where's the states?! Notice the y-axis is just a list of numbers.
#This is populated by the DataFrame's index.
#When we used the .reset_index() method, we created a new numbered index to name each row. 
#Let's fix that by making state the index again.

Now, that we've created a visualization with the states as the y-axis, let's print out the head of the `pivot` object again.

In [ ]:
# Also notice that if we call the DataFrame pivot again, state is not it's index.
#The above method returned a DataFrame with State as index and we plotted it,
#but it did not update the DataFrame itself.

Note that the index has not changed.  That's because the code we wrote when we set the index to the 'State' column returns a copy of the DataFrame object with the index set to 'State'--by default, it does not mutate original `pivot` object.  

If we want to do that, we'll need to capture the new object returned by updating the contents of the `pivot` variable.  

In the cell below, set the index of `pivot` to `'State'`.  Then, recreate the bar plot using this new object.

In [ ]:
#If we wanted to more permanently change the index we would set it first and then plot:
pivot = None

Again, let's check the head of the DataFrame to confirm that the index structure has changed.

Finally, let's stack these bar charts to see how that looks. 

In the cell below, recreate the visualization we did in the cell above, but this time, also pass in `stacked=True` as a parameter.

In [ ]:
# Lastly, let's stack each of these bars for each state.
#Notice we don't have to worry about index here, because we've already set it above.

## Stacking and Unstacking DataFrames

Now, let's get some practice stacking and unstacking DataFrames. 

### Stacking

In the cell below, let's display the head of `grouped` to remind ourselves of the format we left it in.

As we can see above, `grouped` is currently in a flattened format, with no hierarchical structure to it's indices.  

In the cell below, call the `grouped` DataFrame's `.stack()` method.

As we can see, the `stack()` method has stacked our DataFrame from a flattened format into one with a multi-hierarchical index! This is an easy, quick way to aggregate our data.

### Unstacking 

Now, we'll explore unstacking with the `pivot` DataFrame, which is already stacked into a pivot table. 

In the cell below, set unstack `pivot` using the object's `.unstack()` method. Then, display the object to see how it has changed.

In [ ]:
pivot = None

Note that it has unstacked the multi-hierarchical structure of the `pivot` DataFrame by one level. Let's call it one more time and display the results!

In the cell below, set pivot equal to `pivot.unstack()` again, and then display the `pivot` object to see how things have changed.

In [ ]:
pivot = None

After calling unstack a second time, we can see that `pivot` has a flattened structure, since it has been completely unstacked!

## Summary

In this lab, we learned how to:

* Use `groupby` to stack and slice data conditionally
* Use aggregate functions in combination with groupby statements
* Create pivot tables with pandas
* Leverage pivot tables and groupby statements to create quick visualizations
* `stack` and `unstack` DataFrames